erp3l/src/Enums/ПорядокРасчетов/ПорядокРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокРасчетов</name>
  <enumValues>
    <name>ПоДоговорамКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказам</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговорамНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/ОбъектыРасчетов/ОбъектыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыРасчетов</name>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасчетов</name>
    <type>
      <types>EnumRef.ТипыРасчетовСПартнерами</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСсылки</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаРасчетов</name>
    <type>
      <types>EnumRef.ТипыОбъектовРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <comment>Поле 22 &quot;Код&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Партнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <comment>Используется для группировки по территориальному признаку</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <comment>Клиенты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>Поставщики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Публичное наименование, например, для печати или устного обращения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <comment>Конкуренты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <comment>Прочие отношения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <comment>Обслуживаются торговыми представителями</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <comment>Перевозчики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикетокИЦенников</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.КомпанияЧастноеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПереработчика</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <type>
      <types>EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйВидЦены</name>
    <comment>Уточняющий или индивидуальный вид цены</comment>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/CommonModules/ВзаиморасчетыКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ОбщийПрограммныйИнтерфейс

//Сообщает о перезаполнении этапов оплаты.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа/справочника.
// 
Процедура ФормаПослеЗаписи(Форма) Экспорт
	ДополненныеПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	Если ДополненныеПараметрыМеханизма.ОповеститьОЗаполненииЭтапов Тогда
		ЭтапыОплатыКлиент.ОповеститьОбОкончанииЗаполненияЭтаповГрафикаОплаты();
	КонецЕсли;
	Если ДополненныеПараметрыМеханизма.ОповеститьОбИзмененииОбъектаРасчетов Тогда
		ОповеститьОбИзменении(ДополненныеПараметрыМеханизма.ИзмененныйОбъектРасчетов);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ГрафикПлановойОплаты

// Открывает форму редактирования правил оплаты.
// 
// Параметры:
// 	Форма - см. ВзаиморасчетыСервер.ОписаниеФормыВзаиморасчеты
// 	Элемент - ПолеФормы - Гиперссылка открытия формы правил оплаты, связанная с конкретным набором параметров.
// 	СтандартнаяОбработка - Булево - Признак стандартной обработки события.
// 	Оповещение - ОписаниеОповещения - Описание оповещения формы, которое необходимо выполнить после окончания настройки.
//
Процедура НадписьЭтапыОплатыНажатие(Форма, Элемент, СтандартнаяОбработка, Оповещение = Неопределено) Экспорт
	
	Попытка
		Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	Исключение
		ПоказатьПредупреждение(Неопределено, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	ПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	СистемныеНастройки = ПараметрыМеханизма.СистемныеНастройки;
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ВзаиморасчетыКлиентСервер.СтруктураПараметровПоИмениЭлемента(ПараметрыМеханизма.МассивПараметров, Элемент.Имя);
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) Тогда
		ВзаиморасчетыКлиентСервер.ПроверитьОбязательныеПараметры(СтруктураПараметров, "ДатаПлатежа");
	КонецЕсли;
	
	ПорядокРасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПорядокРасчетов);
	ЭтоЗаказ        = СтруктураПараметров.ЭтоЗаказ;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ТолькоПросмотр",                          Форма.ТолькоПросмотр ИЛИ СтруктураПараметров.ЭтапыОплатыТолькоПросмотр);
	
	Если ЗначениеЗаполнено(СтруктураПараметров.СуммаЗалогаЗаТаруФорма) Тогда
		СуммаЗалоговойТары = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.СуммаЗалогаЗаТаруФорма);
	Иначе
		СуммаЗалоговойТары = 0;
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("СуммаЗалогаПоДокументу",                  СуммаЗалоговойТары);
	
	Если ЗначениеЗаполнено(СтруктураПараметров.СуммаДокументаФорма) Тогда
		СуммаВсего = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.СуммаДокументаФорма);
	ИначеЕсли ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧ) Тогда
		ТЧ = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧ);
		СуммаВсего = ТЧ.Итог(СтруктураПараметров.ИмяРеквизитаТЧСуммаСНДС);
	Иначе
		СуммаВсего = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.СуммаДокумента);
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("СуммаОплатыПоДокументу",                  СуммаВсего - СуммаЗалоговойТары);
	
	Если (ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамНакладным")
		ИЛИ ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказамНакладным"))
		И ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа) Тогда
		ПараметрыОткрытия.Вставить("СуммаОбязательнойПредоплаты", СтруктураПараметров.СуммаРасшифровкиПлатежа);
	Иначе
		ПараметрыОткрытия.Вставить("СуммаОбязательнойПредоплаты", 0);
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("ТребуетсяЗалогЗаТару",                    СуммаЗалоговойТары <> 0);
	
	ЭтапыОплаты = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
	ЕстьСуммаОтклоненияМерныхТоваров = СистемныеНастройки.ИспользоватьДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров
										И ЭтапыОплаты <> Неопределено
										И ЭтапыОплаты.Количество() > 0
										И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыОплаты[0],"СуммаОтклоненияМерныхТоваров");
	Если ЕстьСуммаОтклоненияМерныхТоваров Тогда
		СуммаОтклоненияМерныхТоваров = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты).Итог("СуммаОтклоненияМерныхТоваров");
	Иначе
		СуммаОтклоненияМерныхТоваров = 0;
	КонецЕсли;
	ПараметрыОткрытия.Вставить("СуммаОтклоненияПоДокументу",                 СуммаОтклоненияМерныхТоваров);
	
	//реквизиты формы
	ПараметрыОткрытия.Вставить("УникальныйИдентификатор",                 Форма.УникальныйИдентификатор);
	ПараметрыОткрытия.Вставить("Ключ",                                    Форма.Объект.Ссылка);
	ПараметрыОткрытия.Вставить("ПараметрыВыбораРеквизитов",               СтруктураПараметров.ПараметрыВыбораРеквизитов);
	
	//реквизиты объекта
	ПараметрыОткрытия.Вставить("Партнер",                                 ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Партнер));
	ПараметрыОткрытия.Вставить("Соглашение",                              ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Соглашение));
	ПараметрыОткрытия.Вставить("Договор",                                 ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Договор));
	ПараметрыОткрытия.Вставить("Дата",                                    ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Дата));
	ПараметрыОткрытия.Вставить("Валюта",                                  ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ВалютаДокумента));
	ПараметрыОткрытия.Вставить("ГрафикОплаты",                            ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ГрафикОплаты));
	ПараметрыОткрытия.Вставить("ФормаОплаты",                             ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ФормаОплаты));
	ПараметрыОткрытия.Вставить("Касса",                                   ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Касса));
	ПараметрыОткрытия.Вставить("БанковскийСчет",                          ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.БанковскийСчетОрганизации));
	ПараметрыОткрытия.Вставить("Организация",                             ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Организация));
	ПараметрыОткрытия.Вставить("ИдентификаторПлатежа",                    ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ИдентификаторПлатежа));

	ПараметрыОткрытия.Вставить("ПорядокРасчетов",                         ПорядокРасчетов);
	ПараметрыОткрытия.Вставить("НаправлениеДеятельности",                 ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.НаправлениеДеятельности));
	ПараметрыОткрытия.Вставить("ОплатаВВалюте",                           ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ОплатаВВалюте));
	ПараметрыОткрытия.Вставить("ДатаПлатежа",                             ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ДатаПлатежа));
	
	ПутьКДаннымВалютаВзаиморасчетов = ?(СтруктураПараметров.ВалютаВзаиморасчетов = "", СтруктураПараметров.ВалютаДокумента, СтруктураПараметров.ВалютаВзаиморасчетов);
	ПараметрыОткрытия.Вставить("ВалютаВзаиморасчетов",                    ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, ПутьКДаннымВалютаВзаиморасчетов));
	
	//настройки
	НакладнаяПоЗаказам = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.НакладнаяПоЗаказам,, Ложь);
	ПараметрыОткрытия.Вставить("НакладнаяПоЗаказам",                      НакладнаяПоЗаказам И ПорядокРасчетов <> ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоНакладным"));
	
	ПараметрыОткрытия.Вставить("ЭтоЗаказ",                                ЭтоЗаказ);
	ПараметрыОткрытия.Вставить("ИмяПоляЗаказ",                            СтруктураПараметров.ИмяРеквизитаТЧЗаказ);
	ПараметрыОткрытия.Вставить("ЗаказКакСчет",                            СтруктураПараметров.ЗаказКакСчет);
	
	Если СтруктураПараметров.ДокументРасчетовСКлиентами Тогда
		ПараметрыОткрытия.Вставить("ЖелаемаяДатаОтгрузки",                ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ДатаОтсчетаГрафика));
	ИначеЕсли СтруктураПараметров.ДокументРасчетовСПоставщиками Тогда
		ПараметрыОткрытия.Вставить("ЖелаемаяДатаПоступления",             ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ДатаОтсчетаГрафика));
		ПараметрыОткрытия.Вставить("ОтключитьЗаполнениеПоПредыдущимЗаказам", ТипЗнч(Форма.Объект.Ссылка) <> Тип("ДокументСсылка.ЗаказПоставщику"));
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("РежимСамообслуживания",                   ОбщегоНазначенияУТКлиентСервер.АвторизованВнешнийПользователь());
	ПараметрыОткрытия.Вставить("АдресВоВременномХранилище",               СтруктураПараметров.АдресЭтапыОплаты);
	ПараметрыОткрытия.Вставить("АдресСуммПоЗаказам",                      СтруктураПараметров.АдресСуммПоЗаказам);
	
	#Область УХ_Встраивание
	Если ОбщегоназначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "РежимИспользованияГрафика")
		И ОбщегоназначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ПорядокРасчетов") Тогда
		ДолжныФормироватьсяПозиции = АналитикиПланированияДокументовКлиентСервер.ДолжныФормироватьсяПозиции(Форма.Объект);
	Иначе
		ДолжныФормироватьсяПозиции = Ложь;
	КонецЕсли;
	ПараметрыОткрытия.Вставить("ДолжныФормироватьсяПозиции", ДолжныФормироватьсяПозиции);
	#КонецОбласти 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ДополнительныеПараметры.Вставить("СтруктураПараметров", СтруктураПараметров);
	ДополнительныеПараметры.Вставить("ОповещениеПослеЗавершения", Оповещение);
	ДополнительныеПараметры.Вставить("ПараметрыМеханизма", ПараметрыМеханизма);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НадписьЭтапыОплатыНажатиеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Если СтруктураПараметров.ДокументРасчетовСКлиентами Тогда
		ОткрытьФорму("ОбщаяФорма.ЭтапыОплатыКлиентом", 
			ПараметрыОткрытия,
			Форма,,,,
			ОповещениеОЗакрытии,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("ОбщаяФорма.ЭтапыОплатыПоставщику", 
			ПараметрыОткрытия,
			Форма,,,,
			ОповещениеОЗакрытии,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

// Служебный обработчик закрытия формы правил оплаты.
Процедура НадписьЭтапыОплатыНажатиеЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда 
		Если ДополнительныеПараметры.ОповещениеПослеЗавершения <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПослеЗавершения);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Форма               = ДополнительныеПараметры.Форма;
	СтруктураПараметров = ДополнительныеПараметры.СтруктураПараметров;
	ПараметрыМеханизма  = ДополнительныеПараметры.ПараметрыМеханизма;
	СистемныеНастройки  = ПараметрыМеханизма.СистемныеНастройки;
	
	ЭтапыОплаты    = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
	СуммаДокумента = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.СуммаДокументаФорма);
	ДатаПлатежа    = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма, СтруктураПараметров.ДатаПлатежа);
	
	//Реквизиты шапки
	МассивПолей = Новый Массив();
	МассивПолей.Добавить("Касса");
	МассивПолей.Добавить("БанковскийСчетОрганизации");
	МассивПолей.Добавить("ОплатаВВалюте");
	МассивПолей.Добавить("ФормаОплаты");
	МассивПолей.Добавить("ПорядокРасчетов");
	МассивПолей.Добавить("ДатаПлатежа");
	МассивПолей.Добавить("ГрафикОплаты");
	СтарыеЗначенияИзмененныхРеквизитов = ПрисвоитьНовыеЗначения(Форма, СтруктураПараметров, РезультатЗакрытия, МассивПолей);
	
	//Этапы оплаты или дата платежа
	Если ЭтапыОплаты <> Неопределено Тогда
		Если РезультатЗакрытия.Свойство("АдресВоВременномХранилище") Тогда
			СтруктураПараметров.АдресЭтапыОплаты = РезультатЗакрытия.АдресВоВременномХранилище;
		ИначеЕсли РезультатЗакрытия.Свойство("ДатаПлатежа") Тогда
			НовСтр = ЭтапыОплаты.Добавить();
			НовСтр.ДатаПлатежа    = РезультатЗакрытия.ДатаПлатежа;
			НовСтр.СуммаПлатежа   = СуммаДокумента;
			НовСтр.ПроцентПлатежа = 100;
		КонецЕсли;
		ИмяТЧ = Прав(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты, СтрДлина(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) - Найти(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты,"."));
		СтарыеЗначенияИзмененныхРеквизитов.Вставить(ИмяТЧ, Неопределено);
	Иначе
		РеквизитДатаПлатежа = ДатаПлатежа;
		РеквизитДатаПлатежа.Данные[РеквизитДатаПлатежа.Имя] = РезультатЗакрытия.ДатаПлатежа;
	КонецЕсли;
	
	//Стандартный возврат в форму
	РезультатыОбработки = Новый Структура();
	РезультатыОбработки.Вставить("СтарыеЗначенияИзмененныхРеквизитов", СтарыеЗначенияИзмененныхРеквизитов);
	
	ВзаиморасчетыКлиентСервер.ОбновитьТекстГиперссылкиЭтапыОплаты(Форма, СтруктураПараметров, СистемныеНастройки);
	ВзаиморасчетыКлиентСервер.УстановитьВидимостьЗачетаОплаты(Форма, СтруктураПараметров);
	
	Форма.Модифицированность = Истина;
	
	ОбщегоНазначенияУТКлиент.СохранитьДанныеМеханизмаВКэшФормы(Форма, "Взаиморасчеты", ПараметрыМеханизма);
	
	Если ДополнительныеПараметры.ОповещениеПослеЗавершения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПослеЗавершения, РезультатыОбработки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗачетОплатыРасшифровкаПлатежа

// Открывает форму подбора объектов расчетов в табличную часть Расшифровка платежа платежных документов.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа.
// 	ИмяЭлемента - Строка - Имя элемента, по нажатию на который вызван подбор.
// 	Оповещение - ОписаниеОповещения - Описание оповещения формы, которое необходимо выполнить после закрытия формы редактирования расшифровки.
// 	ДополнительныеОтборы - Структура - Ключ - имя реквизита справочника Объекты расчетов, Значение - правое значение отбора.
//
Процедура ПодборВРасшифровкуПлатежа(Форма, ИмяЭлемента, Оповещение = Неопределено, ДополнительныеОтборы = Неопределено) Экспорт 
	
	Попытка
		Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	Исключение
		ПоказатьПредупреждение(Неопределено, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	ПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	СтруктураПараметров = ВзаиморасчетыКлиентСервер.СтруктураПараметровПоИмениЭлемента(ПараметрыМеханизма.МассивПараметров, ИмяЭлемента);
	
	ПартнерПрочиеОтношения = СтруктураПараметров.ПартнерПрочиеОтношения;
	ПодборДебиторскойЗадолженности = СтруктураПараметров.ПодборДебиторскойЗадолженности;
	ПодборТолькоБезусловнойЗадолженности = СтруктураПараметров.ПодборТолькоБезусловнойЗадолженности;
	
	Контрагент           = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Контрагент);
	Ссылка               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Ссылка);
	Организация          = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Организация);
	Валюта               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ВалютаДокумента);
	СуммаДокумента       = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.СуммаДокумента);
	Дата                 = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Дата);
	ИдентификаторПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ИдентификаторПлатежа);
	ТипРасчетов          = СтруктураПараметров.ТипРасчетов;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОбъектСсылка",                          Ссылка);
	ПараметрыОткрытия.Вставить("АдресПлатежейВХранилище",               СтруктураПараметров.АдресРасшифровкаПлатежа);
	ПараметрыОткрытия.Вставить("Организация",                           Организация);
	ПараметрыОткрытия.Вставить("Контрагент",                            Контрагент);
	ПараметрыОткрытия.Вставить("ВалютаДокумента",                       Валюта);
	ПараметрыОткрытия.Вставить("СуммаДокумента",                        СуммаДокумента);
	ПараметрыОткрытия.Вставить("ДатаДокумента",                         Дата);
	ПараметрыОткрытия.Вставить("ТипРасчетов",                           ТипРасчетов);
	ПараметрыОткрытия.Вставить("ИдентификаторПлатежа",                  ИдентификаторПлатежа);
	ПараметрыОткрытия.Вставить("ПартнерПрочиеОтношения",                ПартнерПрочиеОтношения);
	ПараметрыОткрытия.Вставить("ПодборДебиторскойЗадолженности",        ПодборДебиторскойЗадолженности);
	ПараметрыОткрытия.Вставить("ПодборТолькоБезусловнойЗадолженности",  ПодборТолькоБезусловнойЗадолженности);
	ПараметрыОткрытия.Вставить("ДополнительныеОтборы",                  ДополнительныеОтборы);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("СтруктураПараметров", СтруктураПараметров);
	ДополнительныеПараметры.Вставить("ОповещениеПослеЗавершения", Оповещение);
	ДополнительныеПараметры.Вставить("ПараметрыМеханизма", ПараметрыМеханизма);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПодборВРасшифровкуПлатежаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму(
		"Справочник.ОбъектыРасчетов.Форма.ПодборОбъектовРасчетов",
		ПараметрыОткрытия, 
		Форма,,,,
		ОповещениеОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Служебный обработчик закрытия формы правил оплаты.
Процедура ПодборВРасшифровкуПлатежаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда 
		Если ДополнительныеПараметры.ОповещениеПослеЗавершения <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПослеЗавершения);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Форма               = ДополнительныеПараметры.Форма;
	СтруктураПараметров = ДополнительныеПараметры.СтруктураПараметров;
	ПараметрыМеханизма  = ДополнительныеПараметры.ПараметрыМеханизма;
	
	//Этапы оплаты или дата платежа
	Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа) Тогда
		Если РезультатЗакрытия.Свойство("АдресПлатежейВХранилище") Тогда
			СтруктураПараметров.АдресРасшифровкаПлатежа = РезультатЗакрытия.АдресПлатежейВХранилище;
		КонецЕсли;
	КонецЕсли;
	
	//Стандартный возврат в форму
	РезультатыОбработки = Новый Структура();
	РезультатыОбработки.Вставить("Выполнена", Истина);
	
	Форма.Модифицированность = Истина;
	
	ОбщегоНазначенияУТКлиент.СохранитьДанныеМеханизмаВКэшФормы(Форма, "Взаиморасчеты", ПараметрыМеханизма);
	
	Если ДополнительныеПараметры.ОповещениеПослеЗавершения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПослеЗавершения, РезультатыОбработки);
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму выбора объекта расчетов по переданным отборам и настройкам.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа.
// 	Элемент - ПолеФормы - Поле, в котором выбирается объект расчетов или основание платежа.
// 	СтандартнаяОбработка - Булево - Признак стандартной обработки события.
// 	ВыборОснованияПлатежа - Булево - Истина если выбирается Основание платежа, Ложь - если объект расчетов.
// 	ТекущееЗначение - СправочникСсылка, ДокументСсылка - Указывается ссылка на текущий Объект расчетов или текущее Основание платежа для начального позиционирования
//
Процедура ОбъектРасчетовНачалоВыбора(Форма, Элемент, СтандартнаяОбработка, ВыборОснованияПлатежа = ЛОЖЬ, ТекущееЗначение = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Попытка
		Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	Исключение
		ПоказатьПредупреждение(Неопределено, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	ПараметрыМеханизма  = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	СтруктураПараметров = ПараметрыМеханизма.МассивПараметров[0]; // см. ВзаиморасчетыСервер.ПараметрыМеханизма
	
	Ссылка = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Ссылка);
	
	ТаблицаФормы = ОбщегоНазначенияУТКлиентСервер.ТаблицаФормыЭлемента(Элемент);
	ИдентификаторСтроки = Неопределено;
	Если ТаблицаФормы <> Неопределено Тогда 
		ИдентификаторСтроки = ТаблицаФормы.ТекущаяСтрока;
	КонецЕсли;
	
	Контрагент                = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Контрагент, ИдентификаторСтроки);
	Организация               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Организация, ИдентификаторСтроки);
	
	Валюта                    = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ВалютаДокумента);
	ТипРасчетов               = СтруктураПараметров.ТипРасчетов;
	ПлатежиПо275ФЗ            = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПлатежиПо275ФЗ, , Ложь);
	ПодборДебиторскойЗадолженности = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПодборДебиторскойЗадолженности);
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ЭлементыФормы.РасшифровкаПлатежа) Тогда
		ЭлементРасшифровкаПлатежа = Форма.Элементы[СтруктураПараметров.ЭлементыФормы.РасшифровкаПлатежа];
		Сумма = ЭлементРасшифровкаПлатежа.ТекущиеДанные.Сумма;
	Иначе
		Сумма = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.СуммаДокумента);
	КонецЕсли;
	
	ЗначенияОтбора = Новый Структура;
	ЗначенияОтбора.Вставить("ТипРасчетов", ТипРасчетов);
	ЗначенияОтбора.Вставить("Организация", Организация);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ЗначенияОтбора.Вставить("Контрагент",  Контрагент);
	КонецЕсли;
	ЗначенияОтбора.Вставить("ПлатежиПо275ФЗ" , ПлатежиПо275ФЗ);
	
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Организации") Тогда
		ЗначенияОтбора.Вставить("Партнер", ПредопределенноеЗначение("Справочник.Партнеры.НашеПредприятие"));
	КонецЕсли;
	
	НастройкиВыбора = Новый Структура;
	НастройкиВыбора.Вставить("УчитыватьФилиалы", Истина);
	НастройкиВыбора.Вставить("ВыборОснованияПлатежа", ВыборОснованияПлатежа);
	НастройкиВыбора.Вставить("РедактируемыйДокумент", Ссылка);
	НастройкиВыбора.Вставить("Валюта", Валюта);
	НастройкиВыбора.Вставить("Сумма", Сумма);
	НастройкиВыбора.Вставить("Отбор", ЗначенияОтбора);
	НастройкиВыбора.Вставить("ВернутьСтруктуру", Истина);
	НастройкиВыбора.Вставить("ПодборДебиторскойЗадолженности", ПодборДебиторскойЗадолженности);
	Если ТекущееЗначение <> Неопределено Тогда
		НастройкиВыбора.Вставить("ТекущаяСтрока", ТекущееЗначение);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ОбъектыРасчетов.Форма.ФормаВыбора", НастройкиВыбора, Элемент);
	
КонецПроцедуры

// Открывает форму редактирования расшифровки платежа документа возврата.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа.
// 	Элемент - ПолеФормы - Гиперссылка редактирования расшифровки платежа.
// 	Оповещение - ОписаниеОповещения - Описание оповещения формы, которое необходимо выполнить после закрытия формы редактирования расшифровки.
//
Процедура ВзаиморасчетыПоВозвратуТоваров(Форма, Элемент, Оповещение = Неопределено ) Экспорт
	
	Попытка
		Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	Исключение
		ПоказатьПредупреждение(Неопределено, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	ПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	СтруктураПараметров = ВзаиморасчетыКлиентСервер.СтруктураПараметровПоИмениЭлемента(ПараметрыМеханизма.МассивПараметров, Элемент.Имя);
	
	Валюта               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ВалютаДокумента);
	Дата                 = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Дата);
	Контрагент           = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Контрагент);
	Организация          = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Организация);
	Партнер              = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Партнер);
	Проведен             = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, "Объект.Проведен");
	Если ЗначениеЗаполнено(СтруктураПараметров.СуммаДокументаФорма) Тогда
		СуммаДокументаФорма  = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.СуммаДокументаФорма);
	Иначе
		ТЧ = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧ);
		СуммаДокументаФорма = ТЧ.Итог(СтруктураПараметров.ИмяРеквизитаТЧСуммаСНДС);
	КонецЕсли;
	Ссылка               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Ссылка);
	ЭтоРасчетыСКлиентами = СтруктураПараметров.ДокументРасчетовСКлиентами;
	ПартнерПрочиеОтношения = СтруктураПараметров.ПартнерПрочиеОтношения;
	ПодборТолькоБезусловнойЗадолженности = СтруктураПараметров.ПодборТолькоБезусловнойЗадолженности;
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Валюта", Валюта);
	СтруктураОткрытия.Вставить("Дата", Дата);
	СтруктураОткрытия.Вставить("Контрагент", Контрагент);
	СтруктураОткрытия.Вставить("Организация", Организация);
	СтруктураОткрытия.Вставить("Партнер", Партнер);
	СтруктураОткрытия.Вставить("Проведен", Проведен);
	СтруктураОткрытия.Вставить("СуммаТоваров", СуммаДокументаФорма);
	СтруктураОткрытия.Вставить("ИдентификаторВызывающейФормы", Форма.УникальныйИдентификатор);
	СтруктураОткрытия.Вставить("Документ", Ссылка);
	СтруктураОткрытия.Вставить("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
	СтруктураОткрытия.Вставить("АдресПлатежейВХранилище", СтруктураПараметров.АдресРасшифровкаПлатежа);
	СтруктураОткрытия.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр);
	СтруктураОткрытия.Вставить("Объект", Форма.Объект);
	СтруктураОткрытия.Вставить("ПодборТолькоБезусловнойЗадолженности", ПодборТолькоБезусловнойЗадолженности);
	СтруктураОткрытия.Вставить("ПартнерПрочиеОтношения", ПартнерПрочиеОтношения);
	СтруктураОткрытия.Вставить("ИмяВызывающегоЭлемента", Элемент.Имя);
	
	ОткрытьФорму("ОбщаяФорма.ВзаиморасчетыПоВозвратуТоваров",
		СтруктураОткрытия, 
		Форма,,,,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Открывает форму редактирования расшифровки платежа по упр. организации.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа.
// 	Элемент - ПолеФормы - Элемент для определения набора параметров из массива параметров.
// 	Оповещение - ОписаниеОповещения - Описание оповещения формы, которое необходимо выполнить после закрытия формы редактирования расшифровки.
//
Процедура ВзаиморасчетыПоУпрОрганизации(Форма, Элемент, Оповещение = Неопределено ) Экспорт
	
	Попытка
		Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	Исключение
		ПоказатьПредупреждение(Неопределено, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	ПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	СтруктураПараметров = ВзаиморасчетыКлиентСервер.СтруктураПараметровПоИмениЭлемента(ПараметрыМеханизма.МассивПараметров, Элемент.Имя); // см. ВзаиморасчетыСервер.ПараметрыМеханизма
	
	Партнер              = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Партнер);
	Контрагент           = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Контрагент);
	Валюта               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ВалютаДокумента);
	Ссылка               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Ссылка);
	СуммаДокументаФорма  = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.СуммаДокументаФорма);
	ЭтоРасчетыСКлиентами = СтруктураПараметров.ДокументРасчетовСКлиентами;
	
	СтруктураПараметры = Новый Структура();
	СтруктураПараметры.Вставить("АдресПлатежейВХранилище", СтруктураПараметров.АдресРасшифровкаПлатежа);
	СтруктураПараметры.Вставить("Партнер", Партнер);
	СтруктураПараметры.Вставить("Контрагент", Контрагент);
	СтруктураПараметры.Вставить("Валюта", Валюта);
	СтруктураПараметры.Вставить("Документ", Ссылка);
	СтруктураПараметры.Вставить("СуммаВсего",СуммаДокументаФорма);
	СтруктураПараметры.Вставить("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
	
	ОткрытьФорму(
		"ОбщаяФорма.РедактированиеВзаиморасчетов",
		СтруктураПараметры,
		Форма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Открывает форму редактирования расшифровки платежа по упр. организации.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа.
// 	Элемент - ЭлементыФормы - Элемент для определения набора параметров из массива параметров.
//
Процедура ЗачетОплаты(Форма, Элемент = Неопределено) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	
	Обработчик = Новый ОписаниеОповещения("ЗачетОплатыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Форма.Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Данные модифицированы.
			|Зачет оплат доступен только после записи данных.
			|Данные будут записаны.';
			|en = 'The data is modified.
			|Offset of payments is available only after data recording.
			|The data will be recorded.'");
		ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Иначе
		ВыполнитьОбработкуОповещения(Обработчик, КодВозвратаДиалога.Пропустить);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВалютыИКурсДокумента

// Открывает форму редактирования валют и курса взаиморасчетов документа.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма объекта настройки.
// 	Элемент - ДекорацияФормы - Гиперссылка открытия формы правил оплаты, связанная с конкретным набором параметров.
// 	СтандартнаяОбработка - Булево - Признак стандартной обработки события.
// 	Оповещение - ОписаниеОповещения - Описание оповещения, которое необходимо выполнить после окончания настройки.
//
Процедура ВалютыИКурсДокументаНажатие(Форма, Элемент, СтандартнаяОбработка, Оповещение = Неопределено) Экспорт
	
	Попытка
		Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	Исключение
		ПоказатьПредупреждение(Неопределено, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыМеханизма  = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	СистемныеНастройки  = ПараметрыМеханизма.СистемныеНастройки;
	СтруктураПараметров = ПараметрыМеханизма.МассивПараметров[0]; //Курс всегда один на документ.
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧ) Тогда
		ТЧ = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.СуммаДокументаФорма) Тогда
		СуммаДокумента = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.СуммаДокументаФорма);
	ИначеЕсли ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧ) Тогда
		СуммаДокумента = ТЧ.Итог(СтруктураПараметров.ИмяРеквизитаТЧСуммаСНДС);
	Иначе
		СуммаДокумента = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.СуммаДокумента,,0);
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ВалютаДокумента",      ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ВалютаДокумента));
	ПараметрыОткрытия.Вставить("ВалютаВзаиморасчетов", ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ВалютаВзаиморасчетов));
	Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧ) Тогда
		ПараметрыОткрытия.Вставить("СуммаВзаиморасчетов", ТЧ.Итог("СуммаВзаиморасчетов"));
	Иначе
		ПараметрыОткрытия.Вставить("СуммаВзаиморасчетов",  ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.СуммаВзаиморасчетов));
	КонецЕсли;
	ПараметрыОткрытия.Вставить("СуммаДокумента",       СуммаДокумента);
	ПараметрыОткрытия.Вставить("КурсЧислитель",        ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.КурсЧислитель));
	ПараметрыОткрытия.Вставить("КурсЗнаменатель",      ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.КурсЗнаменатель));
	ПараметрыОткрытия.Вставить("ДатаДокумента",        ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Дата));
	ПараметрыОткрытия.Вставить("Организация",          ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Организация));
	
	ПараметрыОткрытия.Вставить("ЭтоДокументПродажи",                 СтруктураПараметров.ДокументРасчетовСКлиентами);
	ПараметрыОткрытия.Вставить("ЭтоДокументЗакупки",                 СтруктураПараметров.ДокументРасчетовСПоставщиками);
	ПараметрыОткрытия.Вставить("ТолькоПросмотр",                     Форма.ТолькоПросмотр ИЛИ СтруктураПараметров.ВалютыИКурсДокументаТолькоПросмотр);
	ПараметрыОткрытия.Вставить("ВалютаДокументаТолькоПросмотр",      СтруктураПараметров.ВалютаДокументаТолькоПросмотр);
	ПараметрыОткрытия.Вставить("ВалютаВзаиморасчетовТолькоПросмотр", СтруктураПараметров.ВалютаВзаиморасчетовТолькоПросмотр);
	ПараметрыОткрытия.Вставить("НеПоказыватьРасчеты",                СтруктураПараметров.НеПоказыватьРасчеты);
	ПараметрыОткрытия.Вставить("НеПересчитыватьСуммуДокумента",      СтруктураПараметров.НеПересчитыватьСуммуДокумента);
	
	//валюта документа только просмотр переносим в форму, т.к. там серверный вызов
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ДополнительныеПараметры.Вставить("СтруктураПараметров", СтруктураПараметров);
	ДополнительныеПараметры.Вставить("СистемныеНастройки", СистемныеНастройки);
	ДополнительныеПараметры.Вставить("ОповещениеПослеЗавершения", Оповещение);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВалютыИКурсДокументаНажатиеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.ВалютыИКурсДокумента", ПараметрыОткрытия, Форма,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

// Обработчик завершения редактирования курса и валют документа.
// 
Процедура ВалютыИКурсДокументаНажатиеЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено ИЛИ РезультатЗакрытия = КодВозвратаДиалога.Отмена Тогда 
		Если ДополнительныеПараметры.ОповещениеПослеЗавершения <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПослеЗавершения);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Форма               = ДополнительныеПараметры.Форма;
	СтруктураПараметров = ДополнительныеПараметры.СтруктураПараметров;
	
	МассивПолей = Новый Массив();
	МассивПолей.Добавить("ВалютаДокумента");
	МассивПолей.Добавить("ВалютаВзаиморасчетов");
	МассивПолей.Добавить("СуммаВзаиморасчетов");
	МассивПолей.Добавить("КурсЧислитель");
	МассивПолей.Добавить("КурсЗнаменатель");
	
	РезультатЗакрытия.Вставить("ВалютаДокумента",РезультатЗакрытия.Валюта);
	
	СтарыеЗначенияИзмененныхРеквизитов = ПрисвоитьНовыеЗначения(Форма, СтруктураПараметров, РезультатЗакрытия, МассивПолей);
	
	Если СтарыеЗначенияИзмененныхРеквизитов.Количество() > 0 Тогда
		Форма.Модифицированность = Истина;
	КонецЕсли;
	
	РезультатыОбработки = Новый Структура();
	РезультатыОбработки.Вставить("СтарыеЗначенияИзмененныхРеквизитов", СтарыеЗначенияИзмененныхРеквизитов);
	РезультатыОбработки.Вставить("НеобходимПересчетСуммДокумента", РезультатЗакрытия.НеобходимПересчетСуммДокумента);
	
	Если ДополнительныеПараметры.ОповещениеПослеЗавершения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПослеЗавершения, РезультатыОбработки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОграниченияЗадолженности

// Открывает форму отчета о причинах ограничения отгрузки.
// 
// Параметры:
// 	Форма - см. ВзаиморасчетыСервер.ОписаниеФормыВзаиморасчеты
// 	Элемент - ПолеФормы - Гиперссылка, по которой отрывается отчет.
// 	СтандартнаяОбработка - Булево - Признак стандартной обработки события.
//
Процедура ОграниченияЗадолженностиНажатие(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыМеханизма  = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	СистемныеНастройки  = ПараметрыМеханизма.СистемныеНастройки;
	СтруктураПараметров = ПараметрыМеханизма.МассивПараметров[0]; //Курс всегда один на документ.
	
	ВзаиморасчетыКлиентСервер.ПроверитьОбязательныеПараметры(СтруктураПараметров,
		"Дата, ВалютаДокумента, Договор, СуммаДокумента, Организация");
	
	Дата                    = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Дата);
	Договор                 = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Договор);
	ВалютаДокумента         = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ВалютаДокумента);
	СуммаДокумента          = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.СуммаДокумента);
	Организация             = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Организация);
		
	ПутьКВалютеВзаиморасчетов = ?(СтруктураПараметров.ВалютаВзаиморасчетов="", СтруктураПараметров.ВалютаДокумента, СтруктураПараметров.ВалютаВзаиморасчетов);
	ВалютаВзаиморасчетов    = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, ПутьКВалютеВзаиморасчетов);
	
	ПутьКСуммеВзаиморасчетов = ?(СтруктураПараметров.СуммаВзаиморасчетов="", СтруктураПараметров.СуммаДокумента, СтруктураПараметров.СуммаВзаиморасчетов);
	СуммаВзаиморасчетов     = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, ПутьКСуммеВзаиморасчетов);
	
	НазначениеИспользования = Форма.Объект.Ссылка;
	
	ДанныеПоСуммеПродажи = Новый Структура();
	ДанныеПоСуммеПродажи.Вставить("Дата", Дата); 
	ДанныеПоСуммеПродажи.Вставить("Валюта", ВалютаДокумента);
	ДанныеПоСуммеПродажи.Вставить("ВалютаВзаиморасчетов", ВалютаВзаиморасчетов);
	ДанныеПоСуммеПродажи.Вставить("СуммаДокумента", СуммаДокумента);
	ДанныеПоСуммеПродажи.Вставить("Организация", Организация);
	
	Если ВалютаДокумента = ВалютаВзаиморасчетов Тогда
		ДанныеПоСуммеПродажи.Вставить("СуммаВзаиморасчетов", СуммаДокумента);
	Иначе //ПутьКДаннымТЧ
		ДанныеПоСуммеПродажи.Вставить("СуммаВзаиморасчетов", СуммаВзаиморасчетов);
	КонецЕсли;
	
	ПродажиКлиент.ОткрытьОтчетРасшифровкиЗапретаОтгрузки(Договор, ДанныеПоСуммеПродажи, НазначениеИспользования, СистемныеНастройки.НоваяАрхитектураВзаиморасчетов);
	
КонецПроцедуры

#КонецОбласти

#Область СостояниеРасчетов

// Открывает форму отчета Карточка расчетов.
// 
// Параметры:
// 	Форма - см. ВзаиморасчетыСервер.ОписаниеФормыВзаиморасчеты
// 	Элемент - ПолеФормы - Гиперссылка, по которой отрывается отчет.
// 	СтандартнаяОбработка - Булево - Признак стандартной обработки события.
//
Процедура РасчетыНажатие(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыМеханизма  = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	СтруктураПараметров = ПараметрыМеханизма.МассивПараметров[0]; //Курс всегда один на документ.
	
	ВзаиморасчетыКлиентСервер.ПроверитьОбязательныеПараметры(СтруктураПараметров,
		"Дата, ВалютаДокумента, Договор, СуммаДокумента");
	
	ОбъектРасчетов          = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ОбъектРасчетов);
	
	Если СтруктураПараметров.ТипРасчетов = ПредопределенноеЗначение("Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом") Тогда
		ОтчетыУТКлиентПереопределяемый.ОткрытьОтчетКарточкаРасчетовСКлиентами("КарточкаРасчетовСКлиентамиПоДокументамКонтекст", ОбъектРасчетов);
	Иначе
		ОтчетыУТКлиентПереопределяемый.ОткрытьОтчетКарточкаРасчетовСПоставщиками("КарточкаРасчетовСПоставщикамиПоДокументамКонтекст", ОбъектРасчетов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрисвоитьНовыеЗначения(Объект, СтруктураПараметров, СтруктураНовыхЗначений, МассивПолей) 
	
	СтарыеЗначенияИзмененныхРеквизитов = Новый Структура;
	
	Для Каждого Поле Из МассивПолей Цикл
		
		Если СтрЧислоВхождений(СтруктураПараметров[Поле],".") > 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Реквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров[Поле]);
		Если Реквизит <> Неопределено И Реквизит.Данные[Реквизит.Имя] <> СтруктураНовыхЗначений[Поле] Тогда
			СтарыеЗначенияИзмененныхРеквизитов.Вставить(Реквизит.Имя, Реквизит.Данные[Реквизит.Имя]);
			Реквизит.Данные[Реквизит.Имя] = СтруктураНовыхЗначений[Поле];
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтарыеЗначенияИзмененныхРеквизитов;
	
КонецФункции

// Параметры:
// 	Ответ - КодВозвратаДиалога -
// 	ДополнительныеПараметры - Структура - :
// 	 * Форма - РасширениеУправляемойФормыДляОбъектов
// 	 * Элемент - ПолеФормы - Элемент, которым вызван зачет оплаты.
Процедура ЗачетОплатыЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	Элемент = ДополнительныеПараметры.Элемент;
	Отказ = Ложь;
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ОчиститьСообщения();
		Отказ = НЕ Форма.Записать();
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Отмена ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыМеханизма  = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	Если Элемент = Неопределено Тогда
		СтруктураПараметров = ПараметрыМеханизма.МассивПараметров[0]; // см. ВзаиморасчетыСервер.ПараметрыМеханизма
	Иначе
		СтруктураПараметров = ВзаиморасчетыКлиентСервер.СтруктураПараметровПоИмениЭлемента(ПараметрыМеханизма.МассивПараметров, Элемент.Имя);
	КонецЕсли;
	
	Если ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПорядокРасчетов) = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказамНакладным")
		И ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧ)
		И ЗначениеЗаполнено(СтруктураПараметров.ИмяРеквизитаТЧЗаказ)
		И ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.НакладнаяПоЗаказам,,Ложь)
		И СтруктураПараметров.ЭтоПродажаЗакупка Тогда
		
		ПодстрокиПути = СтрРазделить(СтруктураПараметров.ПутьКДаннымТЧ,".");
		ПутьКОбъектамЗачета = ПодстрокиПути[ПодстрокиПути.Количество()-1] + "." + СтруктураПараметров.ИмяРеквизитаТЧЗаказ;
		
	ИначеЕсли ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПорядокРасчетов) = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамНакладным")
		И СтруктураПараметров.ЭтоПродажаЗакупка Тогда
		ПутьКОбъектамЗачета = ".Договор";
	Иначе
		ПутьКОбъектамЗачета = "";
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ОбъектРасчетов, Организация, ТипРасчетов, ПутьКОбъектамЗачета");
	Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа) Тогда
		ПараметрыФормы.Вставить("ИмяТЧРасшифровкаПлатежа", СтрРазделить(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа,".")[1]);
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Проведен")
		ИЛИ НЕ Форма.Объект.Проведен Тогда
		ПараметрыФормы.Вставить("АдресРасшифровкаПлатежа", СтруктураПараметров.АдресРасшифровкаПлатежа);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Документ", ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Ссылка));
	ПараметрыФормы.Вставить("ПартнерДокумента", ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Партнер));
	
	Если ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ОбъектРасчетов) <> ПредопределенноеЗначение("Справочник.ОбъектыРасчетов.ПустаяСсылка") Тогда
		ПараметрыФормы.ОбъектРасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ОбъектРасчетов);
	Иначе
		ПараметрыФормы.ОбъектРасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Ссылка);
		ПараметрыФормы.Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Организация);
		ПараметрыФормы.ТипРасчетов = СтруктураПараметров.ТипРасчетов;
	КонецЕсли;
	ПараметрыФормы.ПутьКОбъектамЗачета = ПутьКОбъектамЗачета;
	
	ОткрытьФорму("Обработка.ПомощникЗачетаОплат.Форма", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
